vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/common/IWDG_TYPE_A_registers.h
/* Common IWDG_TYPE_A — generated by stm32_reggen.py.
 * Do not edit this file manually!
 * Superset across: stm32f030, stm32f427, stm32g070, stm32h503, stm32c092
 */

#pragma once
#include "../../stm32_gen_common.h"
#include "IWDG_TYPE_A_index.h"

typedef union {
	struct {
		uint32_t KEY           :16; // /*!< Key value (write only, read 0000h) */
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_iwdg_type_a,kr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_iwdg_type_a,kr),bits);

typedef union {
	struct {
		uint32_t PR            : 3; // /*!< PR[2:0] (Prescaler divider) */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_iwdg_type_a,pr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_iwdg_type_a,pr),bits);

typedef union {
	struct {
		uint32_t RL            :12; // /*!< Watchdog counter reload value */
		uint32_t _reserved12   :20;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_iwdg_type_a,rlr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_iwdg_type_a,rlr),bits);

typedef union {
	struct {
		uint32_t PVU           : 1; // /*!< Watchdog prescaler value update */
		uint32_t RVU           : 1; // /*!< Watchdog counter reload value update */
		uint32_t WVU           : 1; // /*!< Watchdog counter window value update */
		uint32_t EWU           : 1; // /*!< Watchdog interrupt comparator value update */
		uint32_t _reserved4    : 4;
		uint32_t ONF           : 1; // /*!< Watchdog Enable status bit */
		uint32_t _reserved9    : 5;
		uint32_t EWIF          : 1; // /*!< Watchdog early interrupt flag */
		uint32_t _reserved15   :17;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_iwdg_type_a,sr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_iwdg_type_a,sr),bits);

typedef union {
	struct {
		uint32_t WIN           :12; // /*!< Watchdog counter window value */
		uint32_t _reserved12   :20;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_iwdg_type_a,winr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_iwdg_type_a,winr),bits);

typedef union {
	struct {
		uint32_t EWIT          :12; // /*!< Watchdog early wakeup comparator value */
		uint32_t _reserved12   : 2;
		uint32_t EWIC          : 1; // /*!< Watchdog early wakeup comparator value */
		uint32_t EWIE          : 1; // /*!< Watchdog early wakeup comparator value */
		uint32_t _reserved16   :16;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_iwdg_type_a,ewcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_iwdg_type_a,ewcr),bits);

typedef union {
	struct {
		REGDEF_NAME(com_iwdg_type_a,kr) KR;
		REGDEF_NAME(com_iwdg_type_a,pr) PR;
		REGDEF_NAME(com_iwdg_type_a,rlr) RLR;
		REGDEF_NAME(com_iwdg_type_a,sr) SR;
		REGDEF_NAME(com_iwdg_type_a,winr) WINR;
		REGDEF_NAME(com_iwdg_type_a,ewcr) EWCR;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END];
}  REGDEF_NAME(stm32com,iwdg_type_a);
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(stm32com,iwdg_type_a)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,iwdg_type_a), KR) != 0, "Offset mismatch for KR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,iwdg_type_a), PR) != 4, "Offset mismatch for PR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,iwdg_type_a), RLR) != 8, "Offset mismatch for RLR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,iwdg_type_a), SR) != 12, "Offset mismatch for SR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,iwdg_type_a), WINR) != 16, "Offset mismatch for WINR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,iwdg_type_a), EWCR) != 20, "Offset mismatch for EWCR");
